#### Terraform Plan ('src/domains/selfcare/prod/westeurope') 📖
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_api_management.apim_v2_api: Still reading... [10s elapsed]
module.app_services.data.azurerm_linux_function_app.itn_webapp_functions_app: Still reading... [10s elapsed]
data.azurerm_api_management.apim_v2_api: Still reading... [20s elapsed]
data.azurerm_api_management.apim_v2_api: Still reading... [30s elapsed]
data.azurerm_api_management.apim_v2_api: Still reading... [40s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.postgresql.azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "westeurope"
      + name                     = "io-p-weu-subsmigrations-psql-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-selfcare-be-rg"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/pendpoints"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/selfcare/prod/westeurope"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-weu-subsmigrations-psql-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.app_services.module.selfcare_jwt.azurerm_key_vault_secret.jwt_cert will be updated in-place
  ~ resource "azurerm_key_vault_secret" "jwt_cert" {
        id                      = "https://io-p-kv-common.vault.azure.net/secrets/selfcare-jwt-cert/4c7cc906c39f4de7900b5f3756a633d4"
        name                    = "selfcare-jwt-cert"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.postgresql.module.subscriptionmigrations_db_flex_server.azurerm_monitor_metric_alert.this["active_connections"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-weu-subsmigrations-psql-01-ACTIVE_CONNECTIONS"
      + resource_group_name      = "io-p-selfcare-be-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "active_connections"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql.module.subscriptionmigrations_db_flex_server.azurerm_monitor_metric_alert.this["connections_failed"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-weu-subsmigrations-psql-01-CONNECTIONS_FAILED"
      + resource_group_name      = "io-p-selfcare-be-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "connections_failed"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql.module.subscriptionmigrations_db_flex_server.azurerm_monitor_metric_alert.this["cpu_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-weu-subsmigrations-psql-01-CPU_PERCENT"
      + resource_group_name      = "io-p-selfcare-be-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql.module.subscriptionmigrations_db_flex_server.azurerm_monitor_metric_alert.this["memory_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-weu-subsmigrations-psql-01-MEMORY_PERCENT"
      + resource_group_name      = "io-p-selfcare-be-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql.module.subscriptionmigrations_db_flex_server.azurerm_monitor_metric_alert.this["storage_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-weu-subsmigrations-psql-01-STORAGE_PERCENT"
      + resource_group_name      = "io-p-selfcare-be-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql.module.subscriptionmigrations_db_flex_server.azurerm_postgresql_flexible_server.this will be created
  + resource "azurerm_postgresql_flexible_server" "this" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 7
      + create_mode                   = "Default"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "io-p-weu-subsmigrations-psql-01"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "io-p-selfcare-be-rg"
      + sku_name                      = "GP_Standard_D2ds_v5"
      + storage_mb                    = 32768
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/selfcare/prod/westeurope"
        }
      + version                       = "11"

      + authentication (known after apply)

      + maintenance_window {
          + day_of_week  = 3
          + start_hour   = 2
          + start_minute = 0
        }
    }

  # module.postgresql.module.subscriptionmigrations_db_flex_server.azurerm_postgresql_flexible_server_configuration.pgbouncer_enabled[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgbouncer_enabled" {
      + id        = (known after apply)
      + name      = "pgbouncer.enabled"
      + server_id = (known after apply)
      + value     = "True"
    }

  # module.postgresql.module.subscriptionmigrations_db_server.azurerm_management_lock.this[0] will be created
  + resource "azurerm_management_lock" "this" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "io-p-subsmigrations-db-postgresql-lock"
      + notes      = "This items can't be deleted in this subscription!"
      + scope      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-selfcare-be-rg/providers/Microsoft.DBforPostgreSQL/servers/io-p-subsmigrations-db-postgresql"
    }

Plan: 9 to add, 1 to change, 0 to destroy.
::error::Terraform exited with code 1.

```

</details>
